{
    "en": {

      "navAbout": "About Us",
      "navWhyus": "Why Us",
      "navServices": "Services",
      "navFaq": "FAQ",
      "navContact": "Contact Us",

      "heroTitle": "Your Best Partner in Construction Compliance",
      "heroSubtitle": "We’re not just runners of paperwork — we’re compliance partners who help builders start faster and safer.",
      "contactUs": "Contact Us",

      "abHeader": "Sky Consultancy Management & Services is a consultancy firm specializing in government licensing and compliance for the construction industry. We assist contractors, construction firms, and employers with all regulatory matters related to CIDB, foreign labor, and construction site approval.",
      "abInfo": "Our core team has strong practical experience:",
      "abInfoBullet": [
        "Founder Steven has over 5 years of experience in CIDB compliance and registration, having assisted more than 80 contractors with registration, upgrades, blacklist removals, and renewals.",
        "Co-founder Mr. Sky has more than 15 years of experience in foreign labor and immigration matters, specializing in work permits, entry processing, and compliance with Imigresen Malaysia."
      ],
      "abFooter": "We understand the complexity and challenges faced by construction professionals when dealing with government procedures. That’s why we are committed to providing professional, time-saving, and fully compliant one-stop solutions — so you can focus on your projects with complete peace of mind.",

      "whyusTitle1": "Mastery of Process & Internal Insight",
      "whyusDesc1": "With extensive hands-on experience across various case types, we maintain close connections with internal officers from relevant departments to help you complete applications efficiently.",
      "whyusTitle2": "Dedicated Consultant, Full Support",
      "whyusDesc2": "Your personal consultant follows up from start to finish, providing transparent updates and prompt responses to ensure a smooth application process at every step.",
      "whyusTitle3": "Real-World Expertise for Complex Cases",
      "whyusDesc3": "We have rich experience handling a wide range of client cases. Familiar with both on-site realities and government procedures, we offer efficient solutions for even the most complex scenarios.",
      "whyusTitle4": "Integrity-Driven, Win-Win Cooperation",
      "whyusDesc4": "We value long-term partnerships with clear, upfront pricing. No hidden fees, no charges if your application isn’t approved — we build trust through results.",
      "whyusTitle5": "No Jargon, Just What Matters",
      "whyusDesc5": "From the first step to the last, we explain each stage in plain, simple language — so you know exactly what’s happening, and can confidently leave the process to us.",

      "serviceIntro": "We specialize in providing comprehensive government compliance services for construction-related businesses, covering the following areas:",
      "service1Title": "CIDB",
      "service1Desc": "Company registration, Green Card, and grade upgrading for contractors.",
      "clickToView": "Click To View",
      "service1Details": [
        "Apply for CIDB company registration (PPK & SPKK)",
        "Green Card application for construction workers",
        "Grade upgrading services from G1 to G7",
        "Blacklist removal and system dispute handling"
      ],
      "service2Title": "Imigresen",
      "service2Desc": "Apply and renew foreign worker permits including SPIKPA and FOMEMA arrangements.",
      "service2Details": [
        "Application and renewal of foreign worker work permits (PLKS)",
        "Assistance with SPIKPA medical insurance registration",
        "Arrangement and follow-up of FOMEMA medical checkups",
        "Coordination of immigration entry procedures and document preparation",
        "Matching with licensed quota factories or contractor partners"
      ],
      "service3Title": "Expatriate (ESD)",
      "service3Desc": "Employment Pass (EP) application and quota setup for skilled expatriates.",
      "service3Details": [
        "Guidance and process explanation for Employment Pass (EP) application",
        "Company registration in the ESD system with expatriate job setup",
        "Evaluation and submission of expatriate quota applications",
        "Document preparation, online submission, and coordination with immigration authorities",
        "Support for legally onboarding skilled expatriates to work in Malaysia"
      ],
      "service4Title": "Others",
      "service4Desc": "Includes MyKKP (PEMTK) site notification and MOF vendor registration.",
      "service4Details": [
        "Assist in submitting MyKKP (PEMTK) site commencement notifications to JKKP",
        "Prepare required documents and complete the online declaration process",
        "Support clients in obtaining official PEMTK certificates for legal project commencement",
        "Guide companies to register as MOF-certified government vendors",
        "Provide support for meeting requirements to participate in government projects and tenders"
      ],

      "faqDesc": "Frequent Ask Question 1",
      "faqQ1": "FAQ Question 1",
      "faqA1": "FAQ Answer 1"
    },
    "zh": {
      "navAbout": "关于企业",
      "navWhyus": "企业优势",
      "navServices": "提供服务",
      "navFaq": "常见问题",
      "navContact": "联系我们",

      "heroTitle": "您建筑合规的最佳伙伴",
      "heroSubtitle": "我们不只是代办流程，而是让建筑业更安心、合法、高效开工的合规顾问团队",
      "contactUs": "联系我们",
      
      "abAboutus": "关于企业",
      "abHeader": "Sky Consultancy Management & Services 是一家专注于建筑行业的政府执照与合规服务顾问公司，致力于协助承包商、建筑企业及雇主完成所有与 CIDB、外籍劳工与工程开工相关的法定手续。",
      "abInfo": "我们的核心团队拥有丰富的实战经验：",
      "abInfoBullet": [
        "创办人 Steven 在 CIDB 合规与注册服务领域拥有超过 5 年经验，已协助超过 80 家承包商与建筑公司完成 CIDB 注册、更新、黑名单解除与等级升级等服务，深受客户信任。",
        "联合创办人 Mr. Sky 在外籍劳工管理与移民事务方面拥有超过 15 年经验，熟悉移民局（Imigresen Malaysia）的各种程序，擅长协助企业处理外籍准证、劳工入境与合规审查。"
      ],
      "abFooter": "我们理解建筑业者在面对政府程序时的复杂与挑战，因此以「专业、省时、合法」为核心宗旨，提供一站式合规解决方案，让客户能专注工程、无后顾之忧。",
    
      "whyusTitle1": "熟悉流程与精通内部",
      "whyusDesc1": "我们拥有多类型案件实战经验，并与相关部门内部官员保持紧密联系，协助您高效完成相关申请。",
      "whyusTitle2": "专属顾问全程守护",
      "whyusDesc2": "一对一服务专员全程跟进，进度透明、响应迅速，确保您的每个申请流程顺利无忧。",
      "whyusTitle3": "丰富实战专解难题",
      "whyusDesc3": "我们拥有处理各种客户案例的丰富经验，熟悉现场实况与政府流程，专为复杂案例提供高效解决方案。",
      "whyusTitle4": "诚信为本合作共赢",
      "whyusDesc4": "我们注重长期合作关系，承诺明码标价、无隐藏收费，申请不成功不收费。用信任赢客户，用结果做口碑。",
      "whyusTitle5": "不绕术语只讲重点",
      "whyusDesc5": "从第一步到最后一步，我们会用通俗易懂的方式说明每个阶段要做什么，让你明明白白放心交给我们处理。",

      "serviceIntro": "我们专注于为建筑相关企业提供全方位的政府合规服务，涵盖以下领域：",
      "service1Title": "CIDB",
      "service1Desc": "承包商公司CIDB注册、Green Card 劳工卡申请与等级升级服务。",
      "clickToView": "点击查看详情",
      "service1Details": [
        "申请 CIDB 公司注册（PPK & SPKK）",
        "员工 Green Card 工人证申请",
        "G1 至 G7 等级升级服务",
        "黑名单解除与系统处理"
      ],
      "service2Title": "Imigresen",
      "service2Desc": "申请与续签外籍劳工准证，包含 SPIKPA 保险与 FOMEMA 健康检查安排。",
      "service2Details": [
        "外籍劳工工作准证（PLKS）申请与续签",
        "协助 SPIKPA 医疗保险购买流程",
        "FOMEMA 健康检查安排与跟进",
        "安排入境流程与文件准备",
        "对接配额工厂或承包商资源"
      ],
      "service3Title": "Expatriate (ESD)",
      "service3Desc": "协助办理外籍技术人员 Employment Pass（EP）与配额设定。",
      "service3Details": [
        "Employment Pass（EP）申请指导与流程讲解",
        "注册公司于 ESD 系统，设定外籍职位与公司资料",
        "评估与提交外籍职位配额申请",
        "文件准备、线上提交与移民局互动协助",
        "协助高技能外籍人员合法引进至马来西亚就业"
      ],
      "service4Title": "Others",
      "service4Desc": "涵盖 MyKKP（PEMTK）工地开工报备与 MOF 财政部供应商注册。",
      "service4Details": [
        "协助向 JKKP 提交 MyKKP（PEMTK）工地开工报备",
        "准备所需文件并完成线上申报流程",
        "协助客户获取正式 PEMTK 证书，合法开工",
        "指导公司注册成为财政部（MOF）政府供应商",
        "提供政府工程与投标资格的注册支持"
      ],

      "faqDesc": "常见问题详情"
    }
}