{
    "en": {

      "navAbout": "About Us",
      "navWhyus": "Why Us",
      "navServices": "Services",
      "navFaq": "FAQ",
      "navContact": "Contact Us",

      "heroTitle": "Your Best Partner in Construction Compliance",
      "heroSubtitle": "We’re not just runners of paperwork — we’re compliance partners who help builders start faster and safer.",
      "contactUs": "Contact Us",

      "abHeader": "Sky Consultancy Management & Services is a consultancy firm specializing in government licensing and compliance for the construction industry. We assist contractors, construction firms, and employers with all regulatory matters related to CIDB, foreign labor, and construction site approval.",
      "abInfo": "Our core team has strong practical experience:",
      "abInfoBullet": [
        "Founder Steven has over 5 years of experience in CIDB compliance and registration, having assisted more than 80 contractors with registration, upgrades, blacklist removals, and renewals.",
        "Co-founder Mr. Sky has more than 15 years of experience in foreign labor and immigration matters, specializing in work permits, entry processing, and compliance with Imigresen Malaysia."
      ],
      "abFooter": "We understand the complexity and challenges faced by construction professionals when dealing with government procedures. That’s why we are committed to providing professional, time-saving, and fully compliant one-stop solutions — so you can focus on your projects with complete peace of mind.",

      "whyusTitle1": "Mastery of Process & Internal Insight",
      "whyusDesc1": "With extensive hands-on experience across various case types, we maintain close connections with internal officers from relevant departments to help you complete applications efficiently.",
      "whyusTitle2": "Dedicated Consultant, Full Support",
      "whyusDesc2": "Your personal consultant follows up from start to finish, providing transparent updates and prompt responses to ensure a smooth application process at every step.",
      "whyusTitle3": "Real-World Expertise for Complex Cases",
      "whyusDesc3": "We have rich experience handling a wide range of client cases. Familiar with both on-site realities and government procedures, we offer efficient solutions for even the most complex scenarios.",
      "whyusTitle4": "Integrity-Driven, Win-Win Cooperation",
      "whyusDesc4": "We value long-term partnerships with clear, upfront pricing. No hidden fees, no charges if your application isn’t approved — we build trust through results.",
      "whyusTitle5": "No Jargon, Just What Matters",
      "whyusDesc5": "From the first step to the last, we explain each stage in plain, simple language — so you know exactly what’s happening, and can confidently leave the process to us.",

      "serviceIntro": "We specialize in providing comprehensive government compliance services for construction-related businesses, covering the following areas:",

      "service1Title": "CIDB",
      "service1Desc": "CIDB registration for contractor companies, Green Card application for workers, and grade upgrading services.",
      "service1DescDetails": "CIDB (Construction Industry Development Board Malaysia) is the authority responsible for regulating Malaysia’s construction industry, contractor registration, and grade certification. If you are a contractor or engineering company, you must register with CIDB and obtain the appropriate grade (G1 to G7) before participating legally in government or private construction projects.",
      "clickToView": "Click to view details",
      "btnInterest": "WhatsApp Enquiry",
      "service1DetailsObject": [
        {
          "title": "1. CIDB Company Registration (PPK & SPKK focused)",
          "items": ["New license registration", "License renewal", "License grade upgrading", "Company profile updates (address, directors, technical staff, SSM documents, etc.)"]
        },
        {
          "title": "2. CIDB Green Card (Personnel)",
          "items": ["Registration", "Renewal", "Replacement for lost card"]
        },
        {
          "title": "3. Blacklist Removal & System Assistance",
          "items": ["Assistance with incomplete projects, past records, rejected or blocked registrations", "Appeal guidance and CIDB system submission support"]
        },
        {
          "title": "4. Project Declaration",
          "items": ["Assist contractors in submitting construction projects (Projek) to the CIDB system", "Coordinate project start dates and manage data completeness", "Undeclared projects risk penalties during surprise inspections"]
        },
        {
          "title": "5. Other Related Services",
          "items": ["ABM (Construction Academy) course arrangements and registration", "Support for partnership project registration, documentation, and compliance"]
        }
      ],
      "serviceHintTitle": "Pro Tip:",
      "service1HintDesc": "Whether you're registering with CIDB for the first time or upgrading to a higher grade, we can assess your company profile, financial records, and manpower to recommend the best path forward—while helping you avoid common mistakes and system blocks.",
      
      "service2Title": "Imigresen Malaysia",
      "service2Desc": "Application and renewal of foreign worker permits, including SPIKPA insurance and FOMEMA medical checks.",
      "service2DescDetails": "Imigresen Malaysia (Immigration Department of Malaysia) oversees the entry, permit issuance (PLKS), and quota approval for foreign workers. Companies hiring foreign employees (e.g., from Nepal, Bangladesh, Indonesia, etc.) must process permits in collaboration with Imigresen, JTKSM (Labour Department), and KDN (Ministry of Home Affairs).",
      "service2DetailsObject": [
        {
          "title": "1. Quota & Foreign Worker Approval",
          "items": ["Assist companies in applying for JTKSM foreign worker quotas", "Prepare supporting documents for KDN approval letters", "Track application status to avoid delays"]
        },
        {
          "title": "2. PLKS Permit Application & Renewal",
          "items": ["Apply for work permits (Pas Lawatan Kerja Sementara) for new hires", "Annual PLKS renewal service (including passport data updates)", "Permit sticker processing and system integration"]
        },
        {
          "title": "3. SPIKPA Medical Insurance Purchase Support",
          "items": ["SPIKPA is mandatory for foreign workers before permit issuance", "We offer online/bulk purchase assistance and updates"]
        },
        {
          "title": "4. FOMEMA Health Screening & Follow-up",
          "items": ["Foreign workers must pass FOMEMA health checks for permit applications/renewals", "We assist with scheduling, tracking reports, and re-screening if needed"]
        },
        {
          "title": "5. Document Preparation & Entry Process Coordination",
          "items": ["Flight tickets, VDR visa, airport pickup, passport copies, worker photos, etc.", "Provide standard templates and document review service", "Coordinate with agents and manpower agencies for smooth entry"]
        },
        {
          "title": "6. Quota Transfer / Contractor Matching / Special Approval Support",
          "items": ["Support for companies lacking quotas to connect with approved quota holders", "Help resolve issues such as expired quotas or blocked permits", "Handle matters related to ePLKS system"]
        }
      ],
      "service2HintDesc": "We are familiar with every step from 'Quota Application' to 'Permit Issuance' and maintain close ties with agents and manpower agencies. We tailor the entire process to match your factory or construction project needs, ensuring a smooth and compliant workflow.",

      "service3Title": "Expatriate (ESD)",
      "service3Desc": "Support for Employment Pass (EP) applications and quota setup for foreign professionals.",
      "service3DescDetails": "ESD (Expatriate Services Division) is an online system under Imigresen Malaysia that manages work permits (Employment Pass) for foreign professionals. It's required for hiring technical experts, managers, foreign partners, or consultants. Companies must first register under the ESD system as Recognized Companies and apply for quotas before submitting EP applications.",
      "service3DetailsObject": [
        {
          "title": "1. Company Registration & Quota Setup",
          "items": ["Guide company through ESD registration and certification", "Define job titles, functions, salary levels, and categories", "Submit quota requests and track status"]
        },
        {
          "title": "2. EP Application & Renewal Services",
          "items": ["Prepare documents (passport, photo, academic certs, offer letter, etc.)", "Submit e-EP application, manage VDR, endorsement, and related steps", "EP renewals (1/2/3 years)"]
        },
        {
          "title": "3. Other Immigration & HR-Related Affairs",
          "items": ["Job changes, salary adjustment applications", "Company data updates (address, director changes)", "Appeal support for rejected applications"]
        }
      ],
      "service3HintDesc": "We understand the complexity and strict documentation requirements of expatriate permit applications. Sky Consultancy offers end-to-end support from planning to submission and tracking to ensure you bring in top international talent legally and efficiently.",

      "service4Title": "Others",
      "service4Desc": "Covers MyKKP (PEMTK) site notification and MOF supplier registration.",
      "service4DescDetails": "Beyond CIDB and foreign worker permits, we also help clients manage special licenses and reports required by other government departments to ensure legal compliance before project kick-off or tender submissions.",
      "service4DetailsObject": [
        {
          "title": "1. MyKKP (PEMTK) Site Notification",
          "items": ["Assist contractors/developers in submitting project data via JKKP system", "Determine correct submission type (contractor or developer)", "Prepare documents, submit online, and obtain official PEMTK certificate"]
        },
        {
          "title": "2. MOF Supplier Registration",
          "items": ["Assist companies in registering with MOF (new or renewal)", "Ensure the company qualifies to participate in government tenders"]
        },
        {
          "title": "3. SPAN Contractor / Piping Service Registration",
          "items": ["Help register companies under SPAN for water-related construction", "Register categories like Plumbing Contractor, Piping Installer, SPK", "Prepare documents, guide submission, and follow up certification"]
        }
      ],
      "service4HintDesc": "Ideal for project companies about to start construction but haven’t filed PEMTK reports, small contractors planning to bid on government projects without MOF codes, or firms involved in foreign worker dormitories, equipment rental, and civil modifications.",

      "faqDesc": "We've compiled some of the most frequently asked questions from our clients. Click to expand and learn more:",
      "faqQ1": "Are you scammers? Can I pay only after the job is done?",
      "faqA1List": [
        "We understand your concerns about trust in the digital age.",
        "Sky Consultancy follows a milestone-based payment system: we charge a reasonable deposit depending on the service type, and the remaining balance is only collected after the service is completed.",
        "We have numerous successful cases and positive feedback. We would never compromise our brand over a small deposit. Our goal is to build trust, foster long-term partnerships, and gain referrals—not just a one-off deal.",
        "If you're still unsure, we’re happy to provide company registration documents, actual case studies, or proof of collaboration to give you peace of mind before working with us."
      ],
      "faqQ2": "Where is your company located? Can I visit your office?",
      "faqA2": [
        "We do have a physical office, but thanks to technological advancements, we aim to provide efficient online services to clients nationwide in Malaysia.",
        "No matter which state you're in, we can assist you through phone, WhatsApp, or email—ensuring you don’t have to travel just to get things done.",
        "If there's a need for a face-to-face discussion, we're more than happy to arrange an appointment to ensure every detail is clearly communicated."
      ],
      "faqQ3": "My company hasn’t been registered yet. Can I still apply for a license?",
      "faqA3": [
        "Most business-related applications require a registered company. If you haven’t set one up yet, we can assist you with the SSM company registration process.",
        "If needed, we’re also glad to help you build the entire company structure and compliance process from scratch to ensure everything goes smoothly later on."
      ],
      "faqQ4": "What happens if the application fails?",
      "faqA4": [
        "If the application fails due to document issues, we’ll help you make corrections and resubmit. Some services also come with a 'no success, no charge' guarantee.",
        "For services that require upfront fees even if they might not succeed, we will clearly explain the risks and charges before proceeding—rest assured there will be no hidden or surprise fees midway."
      ],
      "faqQ5": "How long does the process take?",
      "faqA5": [
        "It depends on the type of service you're applying for. Each government department and application type has a different processing timeline.",
        "You can let us know what you need assistance with, and we’ll provide a rough timeline based on past experience. We’ll also keep you updated throughout the process for full transparency and peace of mind."
      ],
      "faqQ6": "My project is quite complex. Do you have experience handling such cases?",
      "faqA6": [
        "We’ve handled various complex cases including foreign worker penalty points, project suspensions, and fast-track G upgrades. We have solid hands-on experience and welcome further consultation.",
        "Additionally, we have strong partnerships with professionals and institutions across the industry, enabling us to integrate resources based on your specific situation and deliver the most effective and high-quality solutions."
      ]
    },
    "zh": {
      "navAbout": "关于企业",
      "navWhyus": "企业优势",
      "navServices": "提供服务",
      "navFaq": "常见问题",
      "navContact": "联系我们",

      "heroTitle": "您建筑合规的最佳伙伴",
      "heroSubtitle": "我们不只是代办流程，而是让建筑业更安心、合法、高效开工的合规顾问团队",
      "contactUs": "联系我们",
      
      "abAboutus": "关于企业",
      "abHeader": "Sky Consultancy Management & Services 是一家专注于建筑行业的政府执照与合规服务顾问公司，致力于协助承包商、建筑企业及雇主完成所有与 CIDB、外籍劳工与工程开工相关的法定手续。",
      "abInfo": "我们的核心团队拥有丰富的实战经验：",
      "abInfoBullet": [
        "创办人 Steven 在 CIDB 合规与注册服务领域拥有超过 5 年经验，已协助超过 80 家承包商与建筑公司完成 CIDB 注册、更新、黑名单解除与等级升级等服务，深受客户信任。",
        "联合创办人 Mr. Sky 在外籍劳工管理与移民事务方面拥有超过 15 年经验，熟悉移民局（Imigresen Malaysia）的各种程序，擅长协助企业处理外籍准证、劳工入境与合规审查。"
      ],
      "abFooter": "我们理解建筑业者在面对政府程序时的复杂与挑战，因此以「专业、省时、合法」为核心宗旨，提供一站式合规解决方案，让客户能专注工程、无后顾之忧。",
    
      "whyusTitle1": "熟悉流程与精通内部",
      "whyusDesc1": "我们拥有多类型案件实战经验，并与相关部门内部官员保持紧密联系，协助您高效完成相关申请。",
      "whyusTitle2": "专属顾问全程守护",
      "whyusDesc2": "一对一服务专员全程跟进，进度透明、响应迅速，确保您的每个申请流程顺利无忧。",
      "whyusTitle3": "丰富实战专解难题",
      "whyusDesc3": "我们拥有处理各种客户案例的丰富经验，熟悉现场实况与政府流程，专为复杂案例提供高效解决方案。",
      "whyusTitle4": "诚信为本合作共赢",
      "whyusDesc4": "我们注重长期合作关系，承诺明码标价、无隐藏收费，申请不成功不收费。用信任赢客户，用结果做口碑。",
      "whyusTitle5": "不绕术语只讲重点",
      "whyusDesc5": "从第一步到最后一步，我们会用通俗易懂的方式说明每个阶段要做什么，让你明明白白放心交给我们处理。",

      "serviceIntro": "我们专注于为建筑相关企业提供全方位的政府合规服务，涵盖以下领域：",
      "service1Title": "CIDB",
      "service1Desc": "承包商公司CIDB注册、Green Card 劳工卡申请与等级升级服务。",
      "service1DescDetails": "CIDB（Construction Industry Development Board Malaysia）是马来西亚建筑工业发展局，负责监管全国建筑业发展、承包商注册与等级认证制度。若您是承包商或工程公司，必须先在 CIDB 注册，并取得相应等级（G1 至 G7），才能合法参与政府或私人建筑项目。",
      "clickToView": "点击查看详情",
      "btnInterest": "WhatsApp 询问",
      "service1DetailsObject": [
        {
          "title": "1. 公司 CIDB（主要专注PPK & SPKK）",
          "items": ["新注册执照", "执照更新", "执照等级升级", "公司资料更新（地址、董事、技术人员、SSM 文件等）"]
        },
        {
          "title": "2. CIDB 建筑卡（个人）",
          "items": ["注册", "延期", "遗失重办"]
        },
        {
          "title": "3. 黑名单解除与系统处理",
          "items": ["协助承包商处理未完项目、旧案、拒绝注册或等级封锁", "提供申诉建议与系统申报辅助"]
        },
        {
          "title": "4. 项目上报",
          "items": ["协助承包商提交施工项目（Projek）至 CIDB 系统备案", "配合开工日期、项目资料完整性管理", "如果项目没有申报突击检查将面临处罚"]
        },
        {
          "title": "5. 其他相关事务",
          "items": ["ABM（建筑学院）课程安排与报名", "合作项目注册、文书准备与备案支持"]
        }
      ],
      "serviceHintTitle": "专业建议：",
      "service1HintDesc": "无论您是首次注册 CIDB，还是想升级到更高等级，我们都能根据您的公司状况、财务资料、人力配额，提供最适合的注册/升级路径，并协助您避开常见错误与系统封锁。",
      "service2Title": "Imigresen Malaysia",
      "service2Desc": "申请与续签外籍劳工准证，包含 SPIKPA 保险与 FOMEMA 健康检查。",
      "service2DescDetails": "Imigresen Malaysia（马来西亚移民局）负责外籍劳工入境、合法工作准证（PLKS）以及劳工配额的核准与监督。凡是雇用外籍员工（例如尼泊尔、孟加拉、印尼等）的公司，都需通过移民局、JTKSM（人力资源部）和 KDN（内政部）等多方配合办理准证与入境手续。",
      "service2DetailsObject": [
        {
          "title": "1. 配额与劳工核准申请",
          "items": ["协助公司申请 JTKSM 外劳配额", "准备 KDN（内政部）批准信资料", "追踪批准状态，避免耽误工期"]
        },
        {
          "title": "2. PLKS 准证申请与续签服务",
          "items": ["新聘外劳的工作准证（Pas Lawatan Kerja Sementara）申请", "每年 PLKS 准证续签服务（包括护照资料更新）", "准证贴纸处理与系统对接"]
        },
        {
          "title": "3. SPIKPA 医疗保险协助购买",
          "items": ["SPIKPA 为外劳强制医疗保险，必须于准证前购买", "我们提供线上/批量代购协助与更新"]
        },
        {
          "title": "4. FOMEMA 健康检查安排与跟进",
          "items": ["外劳须通过 FOMEMA 检查才可申请/续签准证", "协助安排检查、查询报告状态、处理复检"]
        },
        {
          "title": "5. 文件准备与入境流程协助",
          "items": ["飞机票、VDR签证、接机、护照副本、劳工照片等", "提供标准表格填写、资料审核服务", "与代理及 Manpower Agency 协调快速入境"]
        },
        {
          "title": "6. 配额转移 / 承包商对接 / 批文追踪等特殊事务",
          "items": ["支援资源不足企业找到合格配额企业合作", "协助解决配额失效、签证受限等问题", "处理与 ePLKS 系统相关事宜"]
        }
      ],
      "service2HintDesc": "我们熟悉劳工入境从“申请配额”到“领取准证”的每个步骤，并与中介及 Manpower Agency 保持联系。配合厂房、建筑项目的实际需求，提供最顺畅的申请流程规划。",
      "service3Title": "Expatriate (ESD)",
      "service3Desc": "协助办理外籍技术人员 Employment Pass（EP）与配额设定。",
      "service3DescDetails": "ESD（Expatriate Services Division）为马来西亚移民局（Imigresen Malaysia）旗下专门处理外籍专业人士工作准证（Employment Pass）的线上系统。它适用于聘请高级技术人员、经理层、外籍合伙人或专业顾问等合法在大马工作的企业与机构。若您是技术型公司、外国控股企业或需要引进特定专业人才的本地公司，必须先透过 ESD 系统注册为认可公司并申请配额（quota）后，才能为外籍员工申请 Employment Pass（EP）。",
      "service3DetailsObject": [
        {
          "title": "1. 公司注册与职位配额申请",
          "items": ["协助公司完成 ESD 线上注册与认证", "协助设定职位名称、岗位性质、薪资等级与所属类别", "提交 Employment Pass 配额申请并追踪状态"]
        },
        {
          "title": "2. Employment Pass（EP）首次申请与续签服务",
          "items": ["准备外籍员工资料（护照、照片、学历证明、聘用信等）", "协助提交电子申请（e-EP）、处理 VDR、贴签等流程", "Employment Pass 续签（1年 / 2年 / 3年）"]
        },
        {
          "title": "3. 其他相关移民局与高层人力资源事务",
          "items": ["职位转换、薪资调整申请", "公司资料更新（换地址、董事变更）", "被拒申请的上诉支持（appeal）"]
        }
      ],
      "service3HintDesc": "我们了解外籍准证流程复杂、耗时且极度讲究文件正确性。Sky Consultancy 提供一站式规划、申报与跟进服务，确保您的企业合法引进高素质人才，顺利开展业务。",
      "service4Title": "Others",
      "service4Desc": "涵盖 MyKKP（PEMTK）工地开工报备与 MOF 财政部供应商注册。",
      "service4DescDetails": "除了常见的 CIDB 和外劳准证，我们也协助客户处理其他政府部门要求的特定执照与报备，确保项目在正式开工或投标前合法合规，不遗漏关键细节。",
      "service4DetailsObject": [
        {
          "title": "1. MyKKP（PEMTK）工地开工报备",
          "items": ["协助承包商/发展商向 JKKP 系统报备项目资料", "判断是否以 kontraktor 或 project developer 身份呈报", "准备文件、完成线上提交并获取正式 PEMTK 证书"]
        },
        {
          "title": "2. 财政部供应商注册（MOF）",
          "items": ["协助公司完成 MOF 注册（新公司或更新）", "保障企业拥有合法政府工程投标资格"]
        },
        {
          "title": "3. SPAN 承包商/管道服务注册",
          "items": ["协助公司在 SPAN 系统注册成为水务领域合法承包商", "注册类别如：Plumbing Contractor、Piping Installer、SPK申请等", "准备文件、指导提交、跟进认证进度"]
        }
      ],
      "service4HintDesc": "工程即将开工但未完成 JKKP 报备的项目公司, 想参与政府招标但尚未注册财政部代码的小型承包商, 项目涉及外劳宿舍、设备租赁、土木改建等特定用途的承包单位",

      "faqDesc": "我们整理了客户最常问的几个问题，点击展开了解详情:",
      "faqQ1": "你们是骗子吗，不可以完成后才付款吗",
      "faqA1List": [
        "我们理解在网络时代，您对诚信的担忧。",
        "Sky Consultancy 所有服务均采分阶段收费制度：我们会根据服务类型征收合理定金，尾款在服务完成后才收取。",
        "我们拥有丰富的客户案例与好评，从不为小额订金毁掉自己的品牌。我们追求的是诚信经营、长期合作与客户转介绍，而不是一次性的交易。",
        "若您仍有顾虑，我们也乐意提供公司注册文件、实际案例或合作证明，让您在了解我们实力后更安心合作。"
      ],
      "faqQ2": "你们公司在哪里，可以上门吗？",
      "faqA2": [
        "我们目前设有实体办公室，但由于科技的发展，我们致力于为全马客户提供便捷、高效的线上服务体验。",
        "无论您位于哪一州属，我们都可以通过电话、WhatsApp 或电邮进行沟通，全程协助您完成申请流程，确保无需舟车劳顿也能安心处理好每一个环节。",
        "如果业务上有需要面对面沟通，我们也非常乐意为您安排预约面谈，确保每一个细节都能沟通无误。"
      ],
      "faqQ3": "我公司还没有成立，可以先申请执照吗？",
      "faqA3": [
        "大部分的业务申请必须使用已注册的公司资料。若您尚未成立公司，我们也可协助您完成 SSM 注册手续。",
        "若有需要，我们也非常乐意协助您从零开始，建立起整个公司的结构与合规流程，确保后续申请顺利进行。"
      ],
      "faqQ4": "如果申请不成功怎么办？",
      "faqA4": [
        "若因资料问题无法通过，我们会协助您补件并再次提交；部分服务可提供“未成功不收费”保障。",
        "如果有需要付费就算是失败的业务，我们也一定会在接案前说明清楚，绝对不会在过程中临时加收费用或产生隐藏收费。"
      ], 
      "faqQ5": "办理时间需要多久？",
      "faqA5": [
        "这将取决于您办理的具体业务类型。不同的政府部门与申请种类，其处理时间都会有所不同。",
        "您可以先告诉我们需要协助的项目类型，我们会根据以往经验告诉您大致的处理时间范围，并在过程中为您持续更新进度，确保安心、透明。"
      ],
      "faqQ6": "我的项目比较复杂，你们有处理经验吗？",
      "faqA6": [
        "我们曾协助处理各类复杂案例，包括外劳扣分、项目停工、快速升级 G 等问题，拥有丰富的实战经验，欢迎您进一步咨询。",
        "此外，我们也与多位行业内专业人士及机构建立了稳固的合作关系，能根据您的具体情况整合资源，为您提供最优质且高效的解决方案。"
      ]
    }
}